trade_exp/src/Catalogs/ДоговорыКредитовИДепозитов/ДоговорыКредитовИДепозитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДоговорыКредитовИДепозитов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b4b81481-6a60-46bd-9c01-397fb628e01f">
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eb431b43-19ef-40d0-bd7f-59281198fa10">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="db9f907b-eae1-4f70-b739-9b1f3f78ea68">
    <name>ВалютаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/ДоговорыКредитовИДепозитов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура Док_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	Док_ПередЗаписьюПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура Док_ПередЗаписьюПослеНаСервере()
	Если ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
		СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
		СтруктураПараметров.Организация = Объект.Организация;
		СтруктураПараметров.БанковскийСчет = Объект.БанковскийСчет;
		
		ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
		Объект.ВалютаВзаиморасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.БанковскийСчет, "ВалютаДенежныхСредств");
	Иначе
		Если Не ЗначениеЗаполнено(Объект.ВалютаВзаиморасчетов) Тогда
			Объект.ВалютаВзаиморасчетов = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Объект.Организация);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
